

#ifndef __BST_SRV_EVENT_H__
#define __BST_SRV_EVENT_H__
/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "BST_Platform.h"
#include "BST_SRV_Define.h"
#include "BST_OS_Thread.h"
#include "BST_OS_Sync.h"
#include "BST_OS_Timer.h"
#include "BST_IP_Define.h"

#if (BST_OS_VER == BST_HISI_VOS)
#pragma pack(4)
#elif(BST_OS_VER == BST_WIN32)
#pragma pack(push, 4)
#endif

/*****************************************************************************
  2 宏定义
*****************************************************************************/

/*****************************************************************************
  3 Massage Declare
*****************************************************************************/

/*****************************************************************************
  4 枚举定义
*****************************************************************************/


/*****************************************************************************
  5 类/结构定义
*****************************************************************************/

class BST_SRV_CEvent
{
BST_PUBLIC:
    static BST_SRV_CEvent              *GetInstance( BST_VOID );
    static BST_VOID                     RcvThread( BST_VOID *pvArg );
    BST_UINT32                          RcvTimerExpired( BST_OS_TIMERID_T ulTimerId );
    BST_ERR_ENUM_UINT8                  RcvTcpIpEvent( BST_IP_EVENT_STRU *pstEvent  );
    BST_ERR_ENUM_UINT8                  RcvAcomData(
        BST_UINT32              ulLength,
        BST_UINT8              *pucData );
    BST_ERR_ENUM_UINT8                  RcvAsEvent(
        BST_AS_EVT_ENUM_UINT32  enAsEvent,
        BST_UINT32              ulLength,
        BST_VOID               *pvData );
BST_PRIVATE:
                                        BST_SRV_CEvent  ( BST_VOID );
                                       ~BST_SRV_CEvent  ( BST_VOID );
    BST_OS_MBX_T                       *m_pstEventMbx;
};
/*****************************************************************************
  6 UNION定义
*****************************************************************************/

/*****************************************************************************
  7 全局变量声明
*****************************************************************************/

/*****************************************************************************
  8 函数声明
*****************************************************************************/

/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/

#if (BST_OS_VER == BST_HISI_VOS)
#pragma pack()
#elif(BST_OS_VER == BST_WIN32)
#pragma pack(pop)
#endif


#endif
